In [2]:
import pandas as pd
 ###Jab tumhare paas bada data ho (jaise Excel sheet) aur tum usko filter, group, sort, ya clean karna chahti ho, toh Pandas usme help karta hai
 ###DataFrame Pandas ka ek 2D (2-dimensional) data structure hai, bilkul jaise Excel sheet ya SQL table.
 ###Series Pandas ka 1D (1-dimensional) data structure hai â€” ek column ya ek row jaisa.

In [3]:
#series
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
##series from dictionay elements
data={'a':1,'b':2,'c':3}

series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
##Dataframe
## create a dataframe from a dictionary of list
data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']

}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Bangalore'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [8]:
##create a dataframe from a list of dictionary
data=[{'Name':'Krish','Age': 25,'City': 'Bangalore'},
      {'Name':'John','Age': 32,'City': 'Bangalore'},
      {'Name':'Jack','Age': 29,'City': 'Bangalore'},
      {'Name':'Bappy','Age': 34,'City': 'Bangalore'}
      ]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   32  Bangalore
2   Jack   29  Bangalore
3  Bappy   34  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [10]:
data=pd.read_csv("/workspaces/ML_krishNaik/data analysis/data/Border_Crossing_Entry_Data.csv")
dFrame=pd.DataFrame(data)
print(dFrame.head())
dFrame.tail()

      Port Name      State  Port Code            Border      Date  \
0       Jackman      Maine        104  US-Canada Border  Jan 2024
1      Porthill      Idaho       3308  US-Canada Border  Apr 2024
2      San Luis    Arizona       2608  US-Mexico Border  Apr 2024
3  Willow Creek    Montana       3325  US-Canada Border  Jan 2024
4       Warroad  Minnesota       3423  US-Canada Border  Jan 2024

                       Measure  Value  Latitude  Longitude  \
0                       Trucks   6556    45.806    -70.397
1                       Trucks     98    49.000   -116.499
2                        Buses     10    32.485   -114.782
3                  Pedestrians      2    49.000   -109.731
4  Personal Vehicle Passengers   9266    48.999    -95.377

                           Point
0   POINT (-70.396722 45.805661)
1   POINT (-116.49925 48.999861)
2    POINT (-114.7822222 32.485)
3  POINT (-109.731333 48.999972)
4      POINT (-95.376555 48.999)

,Port Name,State,Port Code,Border,Date,Measure,Value,Latitude,Longitude,Point
401561,Richford,Vermont,203,US-Canada Border,May 2025,Trucks,171,45.012,-72.589,POINT (-72.588559 45.01174)
401562,Port Angeles,Washington,3007,US-Canada Border,May 2025,Trucks,29,48.122,-123.431,POINT (-123.430694 48.121858)
401563,Nogales,Arizona,2604,US-Mexico Border,May 2025,Rail Containers Loaded,5752,31.333,-110.943,POINT (-110.942516 31.332839)
401564,Hansboro,North Dakota,3415,US-Canada Border,May 2025,Truck Containers Empty,4,49.000,-99.347,POINT (-99.346527 48.999583)
401565,Calexico East,California,2507,US-Mexico Border,May 2025,Train Passengers,22,32.673,-115.388,POINT (-115.388018 32.673389)

In [12]:
dFrame['Port Name']
type(dFrame['Port Name'])

pandas.core.series.Series

In [14]:
dFrame.loc[0]

Port Name                         Jackman
State                               Maine
Port Code                             104
Border                   US-Canada Border
Date                             Jan 2024
Measure                            Trucks
Value                                6556
Latitude                           45.806
Longitude                         -70.397
Point        POINT (-70.396722 45.805661)
Name: 0, dtype: object

In [15]:
dFrame.at[1,'Port Name']

'Porthill'

In [16]:
## accessing specified element using iat
dFrame.iat[2,2]

np.int64(2608)

In [18]:
df['Salary']=[50000,60000,70000,80000]
df

    Name  Age       City  Salary
0  Krish   25  Bangalore   50000
1   John   32  Bangalore   60000
2   Jack   29  Bangalore   70000
3  Bappy   34  Bangalore   80000

In [21]:
df.drop('Salary',axis=1,inplace=True)

In [22]:
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   32  Bangalore
2   Jack   29  Bangalore
3  Bappy   34  Bangalore

In [24]:
df['Age']=df['Age']+1
df

    Name  Age       City
0  Krish   27  Bangalore
1   John   34  Bangalore
2   Jack   31  Bangalore
3  Bappy   36  Bangalore

In [25]:
dFrame.describe()

           Port Code         Value       Latitude      Longitude
count  401566.000000  4.015660e+05  401566.000000  401566.000000
mean     2445.643473  2.900088e+04      43.963519     -99.713359
std      1204.390459  1.494647e+05       8.153385      18.259062
min       101.000000  0.000000e+00      25.952000    -141.001000
25%      2304.000000  0.000000e+00      42.999000    -114.728000
50%      3012.000000  1.500000e+02      48.122000    -101.628000
75%      3401.000000  3.056000e+03      49.000000     -84.361000
max      3814.000000  4.447374e+06      62.615000     -66.980000